// Приветственное уведомление при входе в игру
alert("Добро пожаловать");

// Спрашиваем у пользователя, хочет ли он начать игру
var response = confirm("Хотите начать игру?");

if (response) {
  // Запрашиваем у пользователя загаданное число
  var number = prompt("Пожалуйста, загадайте число от 1 до 10");
  
  // Проверяем, угадал ли пользователь число
  if (number == Math.floor(Math.random() * 10) + 1) {
    // Если угадал, перенаправляем на сайт
    window.location.href = "https://itlabs.uz";
  } else {
    // Если не угадал, выводим сообщение
    alert("Не угадал");
    
    // Закрываем окно
    window.close();
  }
} else {
  // Если пользователь не хочет играть, выводим сообщение
  alert("Жаль, что вы не хотите играть. До свидания!");
}