window.onload = function() {
    // Вывод уведомления
    alert("Добро пожаловать");
  
    // Запрос пользователю о начале игры
    var startGame = confirm("Хотите ли вы начать игру?");
    
    if (startGame) {
      // Если пользователь выбирает "ОК", выполняется этот блок кода
      console.log("Игра началась");
    } else {
      // Если пользователь выбирает "Отмена", выполняется этот блок кода
      console.log("Игра не началась");
    }
  };

//   После вывода уведомления "Добро пожаловать", код предлагает пользователю начать игру с помощью всплывающего окна с вопросом. Если пользователь нажимает кнопку "ОК", в консоль будет выведено сообщение "Игра началась". Если пользователь нажимает кнопку "Отмена", в консоль будет выведено сообщение "Игра не началась".